Adding demo gif and updating readme
